import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoizeLogoMinimalisticDolzhenkov = (
  props: SVGProps<SVGSVGElement>,
  ref: Ref<SVGSVGElement>
) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    viewBox={'0 0 713.46 97.48'}
    xmlns={'http://www.w3.org/2000/svg'}
    {...props}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientTransform={'translate(371.78 -282.43) rotate(90)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_2'}
        x1={'297.84'}
        x2={'364.5'}
        y1={'36.16'}
        y2={'36.16'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'translate(362.09 -269.81) rotate(90)'}
        id={'Безымянный_градиент_2-2'}
        x1={'282.67'}
        x2={'349.32'}
        xlinkHref={'#Безымянный_градиент_2'}
        y1={'46.12'}
        y2={'46.12'}
      />
      <linearGradient
        gradientTransform={'translate(-2.21 -2.75)'}
        id={'Безымянный_градиент_2-3'}
        x1={'265.89'}
        x2={'332.54'}
        xlinkHref={'#Безымянный_градиент_2'}
        y1={'51.49'}
        y2={'51.49'}
      />
      <linearGradient
        gradientTransform={'matrix(0.96, -0.3, 0.3, 0.96, -3.3, 91.62)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_3'}
        x1={'291.47'}
        x2={'312.27'}
        y1={'41.23'}
        y2={'60.06'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
    </defs>
    <title>cardsMemoizeLogoMinimalisticDolzhenkov</title>
    <path
      d={
        'M1.65,64.48C-12.72-2.6,72.82,32.17,28.82,42.85c-18.84-19.56-17,36.34,0,12.33C73.42,69,3.11,85.26,1.65,64.48Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M77.8,65.46C59.42,62,61.9,77.1,46.56,73.28c19.24-81.59,37-46.86,47.5,0C87.33,72.93,77.65,76.24,77.8,65.46ZM74.65,54,70.28,38,65.94,54Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M120,58.06h-6V73.28H99.66V26.4c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,77,124.92,65.19,120,58.06Zm-6-11.92c16.22,3.45,19.58-8.43,0-7Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M192.76,38.16c6,47-15.4,32.78-42.14,35.12V26.4C164.71,28.72,190.74,18.72,192.76,38.16Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21C181.26,64,178.37,54.62,178.74,43Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M201.51,64.39c-1.34-2.27,8.61-4.28,12.08-6.61-4,5.59,18.31,8.1,15.44.86-.77-2-2.81-2.69-4.88-3-13.16-2-20.74-2.08-23.29-11.06-.83-2.91.45-4.26.65-9.3,2-19.8,69.63-6.42,28.12,7.65,4.22-7.75-39.88-9.17,12.75,6.91C258.72,76.72,205.49,82.72,201.51,64.39Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M431.19,25.88V72.72H418.13v-28l-9.59,18.59L399,44.72v28H385.86V25.88c18.83-3.73,18.2,7.52,22.65,15.17C414.86,20.72,422.11,26.58,431.19,25.88Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={'M442.76,25.88H482.4V38H457.11v5.76h16.48v11.1H457.11v5.76H482.4V72.72H442.76Z'}
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M537.06,25.88V72.72H524v-28l-9.59,18.59-9.56-18.52V72.72h-13V25.88c18.83-3.73,18.19,7.52,22.65,15.17C520.73,20.72,528,26.58,537.06,25.88Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M547.7,64c-6.51-44.41,13.87-44.41,41.16-33.77C606.12,89.22,549.26,77.28,547.7,64Zm25.16-4.24c6.7-3.36,3.58-33.37-11.11-17.35C562.24,52.09,557.49,61.29,572.86,59.72Z'
      }
      transform={'translate(0 0)'}
    />
    <path d={'M600.48,25.88h14.38V72.72H600.48Z'} transform={'translate(0 0)'} />
    <path
      d={
        'M664.14,37.07,644.48,59.6h19.66V72.72H624.51c-4.9-10.89,14.94-27.33,19.66-33.72H624.51V25.88h39.63Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={'M673.86,25.88h39.6V38H688.17v5.76h16.49v11.1H688.17v5.76h25.29V72.72h-39.6Z'}
      transform={'translate(0 0)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_2)'}
      height={'66.65'}
      rx={'9.49'}
      transform={'translate(212.61 364.79) rotate(-77)'}
      width={'82.84'}
      x={'294.2'}
      y={'15.41'}
    />
    <path
      d={
        'M351.68,96.71a11.53,11.53,0,0,1-2.6-.3L302.62,85.68A11.5,11.5,0,0,1,294,71.91L308.38,9.68a11.5,11.5,0,0,1,13.78-8.61L368.62,11.8a11.48,11.48,0,0,1,8.6,13.77L362.85,87.81a11.49,11.49,0,0,1-11.17,8.9ZM319.57,4.77a7.51,7.51,0,0,0-7.29,5.81L297.91,72.81a7.5,7.5,0,0,0,5.61,9L350,92.51a7.48,7.48,0,0,0,9-5.6l14.37-62.24a7.49,7.49,0,0,0-5.61-9L321.26,5A7.57,7.57,0,0,0,319.57,4.77Z'
      }
      transform={'translate(0 0)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_2-2)'}
      height={'66.65'}
      rx={'9.49'}
      transform={'translate(268.81 362.01) rotate(-89.83)'}
      width={'82.84'}
      x={'274.54'}
      y={'12.86'}
    />
    <path
      d={
        'M339.71,89.68h0L292,89.54A11.49,11.49,0,0,1,280.54,78l.19-63.87A11.43,11.43,0,0,1,284.12,6a11.31,11.31,0,0,1,8.13-3.34l47.68.14a11.5,11.5,0,0,1,11.45,11.52l-.19,63.87A11.5,11.5,0,0,1,339.71,89.68Zm-47.49-83a7.48,7.48,0,0,0-7.49,7.46L284.54,78A7.48,7.48,0,0,0,292,85.54l47.68.14h0a7.49,7.49,0,0,0,7.48-7.46l.19-63.87a7.48,7.48,0,0,0-7.46-7.51L292.24,6.7Z'
      }
      transform={'translate(0 0)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_2-3)'}
      height={'82.84'}
      rx={'9.49'}
      transform={'translate(-1.97 83.41) rotate(-15.93)'}
      width={'66.65'}
      x={'263.68'}
      y={'7.32'}
    />
    <path
      d={
        'M282.85,97.48a11.5,11.5,0,0,1-11.05-8.33L254.27,27.73a11.5,11.5,0,0,1,7.89-14.2h0L308,.44A11.51,11.51,0,0,1,322.2,8.33l17.54,61.42A11.5,11.5,0,0,1,331.85,84L286,97A11.46,11.46,0,0,1,282.85,97.48ZM311.16,4a7.37,7.37,0,0,0-2.06.29L263.25,17.38a7.49,7.49,0,0,0-5.14,9.25l17.54,61.42a7.49,7.49,0,0,0,9.25,5.14L330.75,80.1a7.49,7.49,0,0,0,5.14-9.25L318.36,9.43A7.51,7.51,0,0,0,311.16,4Z'
      }
      transform={'translate(0 0)'}
    />
    <path
      d={
        'M291.13,17.79l-6.6,38.79A1.29,1.29,0,0,0,286.19,58l10.49-3.29,4.65,25.58a.54.54,0,0,0,1.05.05l7-37.35A1.14,1.14,0,0,0,308,41.71l-10.5,3.11-5.36-27A.5.5,0,0,0,291.13,17.79Z'
      }
      fill={'url(#Безымянный_градиент_3)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(0 0)'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoizeLogoMinimalisticDolzhenkov)
const Memo = memo(ForwardRef)

export default Memo
