import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoizeLogoMinimalistic = (
  props: SVGProps<SVGSVGElement>,
  ref: Ref<SVGSVGElement>
) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    {...props}
    viewBox={'0 0 696.6 113.84'}
    xmlns={'http://www.w3.org/2000/svg'}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_2'}
        x1={'266.13'}
        x2={'346.87'}
        y1={'58.16'}
        y2={'58.16'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      <linearGradient
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_3'}
        x1={'294.06'}
        x2={'328.72'}
        y1={'51.01'}
        y2={'82.42'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        id={'Безымянный_градиент_3-2'}
        x1={'140.59'}
        x2={'159.87'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'10.44'}
        y2={'10.44'}
      />
      <linearGradient
        gradientTransform={'matrix(1, 0, 0, -1, 31.07, -111.05)'}
        id={'Безымянный_градиент_3-3'}
        x1={'545.9'}
        x2={'573.03'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'-128.84'}
        y2={'-128.84'}
      />
    </defs>
    <title>cardsMemoizeLogoMinimalistic</title>
    <path
      d={
        'M150.23,14.77C122.89,2.55,95.16,0,65.88,13.7c8.19-1.47,15.57-4.09,22-3.57-11,7.23-12.6,9.19-16.09,14C94.73,5.79,118.21,6.88,150.23,14.77Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_2)'}
      height={'100.35'}
      rx={'11.49'}
      width={'80.74'}
      x={'266.13'}
      y={'7.99'}
    />
    <path
      d={
        'M1.65,73.76C-12.72,6.68,72.82,41.45,28.82,52.13c-18.84-19.56-17,36.34,0,12.33C73.42,78.23,3.11,94.54,1.65,73.76Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M77.8,74.74c-18.38-3.47-15.9,11.64-31.24,7.82,19.24-81.59,37-46.86,47.5,0C87.33,82.21,77.65,85.52,77.8,74.74ZM74.65,63.23,70.28,47.28,65.94,63.23Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M120,67.34h-6V82.56H99.66V35.68c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,86.26,124.92,74.47,120,67.34Zm-6-11.92c16.22,3.45,19.58-8.43,0-7Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M192.76,47.44c6,47-15.4,32.78-42.14,35.12V35.68C164.71,38,190.74,28,192.76,47.44Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21c16.28,3.61,13.39-5.73,13.76-17.38Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M201.51,73.67c-1.34-2.27,8.61-4.28,12.08-6.61-4,5.59,18.31,8.1,15.44.86-.77-2-2.81-2.69-4.88-3-13.16-2-20.74-2.08-23.29-11.06-.83-2.91.45-4.26.65-9.3,2-19.8,69.63-6.42,28.12,7.65,4.22-7.75-39.88-9.17,12.75,6.91C258.72,86,205.49,92,201.51,73.67Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M414.33,35.16V82H401.27V54l-9.59,18.59L382.09,54V82H369V35.16c18.83-3.73,18.2,7.52,22.65,15.17C398,30,405.25,35.86,414.33,35.16Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={'M425.9,35.16h39.64V47.29H440.25v5.76h16.48v11.1H440.25v5.76h25.29V82H425.9Z'}
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M520.2,35.16V82H507.15V54l-9.59,18.59L488,54.07V82H475V35.16c18.83-3.73,18.19,7.52,22.65,15.17C503.87,30,511.13,35.86,520.2,35.16Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M530.84,73.24C524.33,28.83,544.71,28.83,572,39.47,589.26,98.5,532.4,86.56,530.84,73.24ZM556,69c6.7-3.36,3.58-33.37-11.11-17.35C545.38,61.37,540.63,70.57,556,69Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path d={'M583.62,35.16H598V82H583.62Z'} transform={'translate(0 -4.33)'} />
    <path
      d={
        'M647.28,46.35,627.62,68.88h19.66V82H607.65c-4.9-10.89,14.94-27.33,19.66-33.72H607.65V35.16h39.63Z'
      }
      transform={'translate(0 -4.33)'}
    />
    <path
      d={'M657,35.16h39.6V47.29H671.31v5.76H687.8v11.1H671.31v5.76H696.6V82H657Z'}
      transform={'translate(0 -4.33)'}
    />
    <path
      d={
        'M313.42,10.05,283.76,68.54a2.15,2.15,0,0,0,1.92,3.13l18.33,0-5.22,43a.9.9,0,0,0,1.66.58l29.62-56a1.9,1.9,0,0,0-1.65-2.8l-18.25-.23L315,10.57A.83.83,0,0,0,313.42,10.05Z'
      }
      fill={'url(#Безымянный_градиент_3)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'5'}
      transform={'translate(0 -4.33)'}
    />
    <polygon
      fill={'url(#Безымянный_градиент_3-2)'}
      points={
        '159.87 10.44 152.8 13.01 150.23 20.07 147.66 13.01 140.59 10.44 147.66 7.86 150.23 0.8 152.8 7.86 159.87 10.44'
      }
    />
    <path
      d={
        'M577,15.1l6,13.76a35.47,35.47,0,0,0,15.73,0l5.38-13.75a.26.26,0,0,0-.15-.32.22.22,0,0,0-.22,0l-6.94,4.82a1.1,1.1,0,0,1-1.52-.27,1.11,1.11,0,0,1-.15-.31L591,6a.25.25,0,0,0-.31-.17h0a.29.29,0,0,0-.17.17l-3.89,13.12a1.09,1.09,0,0,1-1.36.73.84.84,0,0,1-.29-.13l-7.66-5a.24.24,0,0,0-.35.05.28.28,0,0,0,0,.29Z'
      }
      fill={'url(#Безымянный_градиент_3-3)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(0 -4.33)'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoizeLogoMinimalistic)
const Memo = memo(ForwardRef)

export default Memo
