import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoizeLogoMinimalisticDolzhenkovGolden = (
  props: SVGProps<SVGSVGElement>,
  ref: Ref<SVGSVGElement>
) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    viewBox={'0 0 713.46 96.1'}
    xmlns={'http://www.w3.org/2000/svg'}
    {...props}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientTransform={'translate(372.83 -283.05) rotate(90)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_5'}
        x1={'299.54'}
        x2={'364.74'}
        y1={'36.29'}
        y2={'36.29'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'translate(363.82 -270.75) rotate(90)'}
        id={'Безымянный_градиент_5-2'}
        x1={'284.74'}
        x2={'349.94'}
        xlinkHref={'#Безымянный_градиент_5'}
        y1={'46.52'}
        y2={'46.52'}
      />
      <linearGradient
        gradientTransform={'translate(-2.05 -3.22)'}
        id={'Безымянный_градиент_5-3'}
        x1={'268.2'}
        x2={'333.4'}
        xlinkHref={'#Безымянный_градиент_5'}
        y1={'52.31'}
        y2={'52.31'}
      />
      <linearGradient
        gradientTransform={'matrix(0.73, -0.68, -0.68, -0.73, 95.1, 304.91)'}
        id={'Безымянный_градиент_5-4'}
        x1={'304.62'}
        x2={'328.75'}
        xlinkHref={'#Безымянный_градиент_5'}
        y1={'105.85'}
        y2={'105.85'}
      />
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.31, 199.04)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_25'}
        x1={'294.21'}
        x2={'299.36'}
        y1={'88.73'}
        y2={'59.68'}
      >
        <stop offset={'0'} stopColor={'#6a45ff'} />
        <stop offset={'0.28'} stopColor={'#7d40ff'} />
        <stop offset={'0.73'} stopColor={'#9839ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.31, 199.04)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_4'}
        x1={'281.41'}
        x2={'303.26'}
        y1={'87.8'}
        y2={'67.99'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'translate(0.65 83.3) rotate(-15.3)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_24'}
        x1={'301.28'}
        x2={'291.86'}
        y1={'61.04'}
        y2={'29.77'}
      >
        <stop offset={'0'} stopColor={'#7200ff'} />
        <stop offset={'0.07'} stopColor={'#7605ff'} />
        <stop offset={'0.68'} stopColor={'#9628ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
    </defs>
    <title>cardsMemoizeLogoMinimalisticDolzhenkovGolden</title>
    <path
      d={
        'M1.65,64.48C-12.72-2.6,72.82,32.17,28.82,42.85c-18.84-19.56-17,36.34,0,12.33C73.42,69,3.11,85.26,1.65,64.48Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M77.8,65.46C59.42,62,61.9,77.1,46.56,73.28c19.24-81.59,37-46.86,47.5,0C87.33,72.93,77.65,76.24,77.8,65.46ZM74.65,54,70.28,38,65.94,54Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M120,58.06h-6V73.28H99.66V26.4c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,77,124.92,65.19,120,58.06Zm-6-11.92c16.22,3.45,19.58-8.43,0-7Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M192.76,38.16c6,47-15.4,32.78-42.14,35.12V26.4C164.71,28.72,190.74,18.72,192.76,38.16Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21C181.26,64,178.37,54.62,178.74,43Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M201.51,64.39c-1.34-2.27,8.61-4.28,12.08-6.61-4,5.59,18.31,8.1,15.44.86-.77-2-2.81-2.69-4.88-3-13.16-2-20.74-2.08-23.29-11.06-.83-2.91.45-4.26.65-9.3,2-19.8,69.63-6.42,28.12,7.65,4.22-7.75-39.88-9.17,12.75,6.91C258.72,76.72,205.49,82.72,201.51,64.39Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M431.19,25.88V72.72H418.13v-28l-9.59,18.59L399,44.72v28H385.86V25.88c18.83-3.73,18.2,7.52,22.65,15.17C414.86,20.72,422.11,26.58,431.19,25.88Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={'M442.76,25.88H482.4V38H457.11v5.76h16.48v11.1H457.11v5.76H482.4V72.72H442.76Z'}
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M537.06,25.88V72.72H524v-28l-9.59,18.59-9.56-18.52V72.72h-13V25.88c18.83-3.73,18.19,7.52,22.65,15.17C520.73,20.72,528,26.58,537.06,25.88Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M547.7,64c-6.51-44.41,13.87-44.41,41.16-33.77C606.12,89.22,549.26,77.28,547.7,64Zm25.16-4.24c6.7-3.36,3.58-33.37-11.11-17.35C562.24,52.09,557.49,61.29,572.86,59.72Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path d={'M600.48,25.88h14.38V72.72H600.48Z'} transform={'translate(0 -0.66)'} />
    <path
      d={
        'M664.14,37.07,644.48,59.6h19.66V72.72H624.51c-4.9-10.89,14.94-27.33,19.66-33.72H624.51V25.88h39.63Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={'M673.86,25.88h39.6V38H688.17v5.76h16.49v11.1H688.17v5.76h25.29V72.72h-39.6Z'}
      transform={'translate(0 -0.66)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_5)'}
      height={'65.2'}
      rx={'9.28'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(212.99 365.28) rotate(-77)'}
      width={'81.04'}
      x={'296.01'}
      y={'16.49'}
    />
    <path
      d={
        'M352.25,96a11.66,11.66,0,0,1-2.55-.29l-45.45-10.5a11.24,11.24,0,0,1-8.42-13.47l14.06-60.88a11.25,11.25,0,0,1,13.47-8.42L368.81,13a11.24,11.24,0,0,1,8.42,13.47L363.17,87.3A11.24,11.24,0,0,1,352.25,96ZM320.84,6.08a7.33,7.33,0,0,0-7.14,5.67L299.64,72.63a7.34,7.34,0,0,0,5.49,8.78l45.45,10.5a7.34,7.34,0,0,0,8.78-5.49l14.06-60.88a7.33,7.33,0,0,0-5.49-8.78L322.48,6.27A7.12,7.12,0,0,0,320.84,6.08Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_5-2)'}
      height={'65.2'}
      rx={'9.28'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(269.75 363.09) rotate(-89.83)'}
      width={'81.04'}
      x={'276.78'}
      y={'13.99'}
    />
    <path
      d={
        'M340.53,89.13h0L293.85,89a11.23,11.23,0,0,1-11.2-11.27l.19-62.48a11.16,11.16,0,0,1,3.32-7.93A11.06,11.06,0,0,1,294.11,4l46.64.15A11.24,11.24,0,0,1,352,15.45l-.19,62.48A11.24,11.24,0,0,1,340.53,89.13ZM294.08,8a7.32,7.32,0,0,0-7.33,7.3l-.19,62.47a7.32,7.32,0,0,0,7.3,7.35l46.65.14h0a7.33,7.33,0,0,0,7.32-7.3L348,15.44a7.33,7.33,0,0,0-7.3-7.34L294.1,8Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_5-3)'}
      height={'81.04'}
      rx={'9.28'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(-2 83.24) rotate(-15.93)'}
      width={'65.2'}
      x={'266.16'}
      y={'8.57'}
    />
    <path
      d={
        'M284.91,96.76a11.26,11.26,0,0,1-10.81-8.15L257,28.53a11.24,11.24,0,0,1,7.72-13.88h0L309.52,1.84a11.25,11.25,0,0,1,13.89,7.72l17.15,60.08a11.24,11.24,0,0,1-7.72,13.88L288,96.33A11.33,11.33,0,0,1,284.91,96.76ZM312.6,5.32a7.38,7.38,0,0,0-2,.28L265.74,18.41a7.32,7.32,0,0,0-5,9.05l17.16,60.08a7.33,7.33,0,0,0,9.05,5l44.85-12.81a7.33,7.33,0,0,0,5-9.05L319.65,10.63A7.34,7.34,0,0,0,312.6,5.32Z'
      }
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M245.37,18.62l12.2,5.4a31.61,31.61,0,0,0,10.27-9.49L263.05,2.3a.22.22,0,0,0-.29-.12.2.2,0,0,0-.14.13L261,9.65a1,1,0,0,1-1.16.74,1,1,0,0,1-.28-.11L249.05,4.22a.24.24,0,0,0-.31.08h0a.2.2,0,0,0,0,.2l5.38,10.92a1,1,0,0,1-.44,1.3.72.72,0,0,1-.27.09l-8,1.38a.22.22,0,0,0,0,.43Z'
      }
      fill={'url(#Безымянный_градиент_5-4)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M294.36,16.06l-8.31,40.51a1.37,1.37,0,0,0,1.05,1.61,1.54,1.54,0,0,0,.64,0l11.15-3.06,4,27a.57.57,0,0,0,.64.48.59.59,0,0,0,.47-.4l8.7-39a1.2,1.2,0,0,0-.9-1.43,1.22,1.22,0,0,0-.57,0l-11.14,2.9-4.66-28.57a.53.53,0,0,0-.5-.55A.52.52,0,0,0,294.36,16.06Z'
      }
      fill={'url(#Безымянный_градиент_25)'}
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M294.49,16.55l-8.3,40.52a1.34,1.34,0,0,0,1.05,1.6,1.39,1.39,0,0,0,.64,0l11.15-3,4,27a.56.56,0,0,0,1.1.08l8.7-39a1.2,1.2,0,0,0-.9-1.44,1.22,1.22,0,0,0-.57,0l-11.14,2.9L295.54,16.6a.53.53,0,0,0-.5-.55A.54.54,0,0,0,294.49,16.55Z'
      }
      fill={'url(#Безымянный_градиент_4)'}
      transform={'translate(0 -0.66)'}
    />
    <path
      d={
        'M304,84.12l-.25,0a2.17,2.17,0,0,1-1.6-.4,2.1,2.1,0,0,1-.84-1.41L297.59,57.1l-9.43,2.58h0a3,3,0,0,1-1.37,0,2.93,2.93,0,0,1-2.27-3.47l8.29-40.43a2.1,2.1,0,0,1,3.64-1.15A2.07,2.07,0,0,1,297,16l4.36,26.75,9.47-2.46a2.81,2.81,0,0,1,1.32,0,2.77,2.77,0,0,1,2.08,3.33l-8.72,39.08A2.16,2.16,0,0,1,304,84.12Zm-5.53-30.54,1.72-.47,3.44,23.39,7.37-33-12.21,3.17-4-24.7-7.09,34.6ZM287.6,56.89Zm-.28-.25Zm23.82-13.77Z'
      }
      fill={'url(#Безымянный_градиент_24)'}
      transform={'translate(0 -0.66)'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoizeLogoMinimalisticDolzhenkovGolden)
const Memo = memo(ForwardRef)

export default Memo
