import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoizeLogoMinimalisticGolden = (
  props: SVGProps<SVGSVGElement>,
  ref: Ref<SVGSVGElement>
) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    viewBox={'0 0 696.6 113.71'}
    xmlns={'http://www.w3.org/2000/svg'}
    {...props}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_3'}
        x1={'578.14'}
        x2={'602.93'}
        y1={'18.37'}
        y2={'18.37'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        id={'Безымянный_градиент_3-2'}
        x1={'140.59'}
        x2={'159.87'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'10.3'}
        y2={'10.3'}
      />
      <linearGradient
        gradientTransform={'matrix(1, 0, 0, -1, 0, 115.53)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_10'}
        x1={'278.49'}
        x2={'333.82'}
        y1={'79.84'}
        y2={'35.72'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'0.34'} stopColor={'#ffc226'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'matrix(1, 0, 0, -1, 0, 120)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_25'}
        x1={'302.59'}
        x2={'310.76'}
        y1={'80.42'}
        y2={'34.36'}
      >
        <stop offset={'0'} stopColor={'#6a45ff'} />
        <stop offset={'0.28'} stopColor={'#7d40ff'} />
        <stop offset={'0.73'} stopColor={'#9839ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'matrix(1, 0, 0, -1, 0, 120)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_11'}
        x1={'282.28'}
        x2={'316.94'}
        y1={'78.95'}
        y2={'47.54'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      <linearGradient
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_24'}
        x1={'313.79'}
        x2={'298.85'}
        y1={'86.78'}
        y2={'37.2'}
      >
        <stop offset={'0'} stopColor={'#7200ff'} />
        <stop offset={'0.07'} stopColor={'#7605ff'} />
        <stop offset={'0.68'} stopColor={'#9628ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
    </defs>
    <title>cardsMemoizeLogoMinimalisticGolden</title>
    <path
      d={
        'M150.23,14.77C122.89,2.55,95.16,0,65.88,13.7c8.19-1.47,15.57-4.09,22-3.57-11,7.23-12.6,9.19-16.09,14C94.73,5.79,118.21,6.88,150.23,14.77Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M1.65,73.76C-12.72,6.68,72.82,41.45,28.82,52.13c-18.84-19.56-17,36.34,0,12.33C73.42,78.23,3.11,94.54,1.65,73.76Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M77.8,74.74c-18.38-3.47-15.9,11.64-31.24,7.82,19.24-81.59,37-46.86,47.5,0C87.33,82.21,77.65,85.52,77.8,74.74ZM74.65,63.23,70.28,47.28,65.94,63.23Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M120,67.34h-6V82.56H99.66V35.68c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,86.26,124.92,74.47,120,67.34Zm-6-11.92c16.22,3.45,19.58-8.43,0-7Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M192.76,47.44c6,47-15.4,32.78-42.14,35.12V35.68C164.71,38,190.74,28,192.76,47.44Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21c16.28,3.61,13.39-5.73,13.76-17.38Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M201.51,73.67c-1.34-2.27,8.61-4.28,12.08-6.61-4,5.59,18.31,8.1,15.44.86-.77-2-2.81-2.69-4.88-3-13.16-2-20.74-2.08-23.29-11.06-.83-2.91.45-4.26.65-9.3,2-19.8,69.63-6.42,28.12,7.65,4.22-7.75-39.88-9.17,12.75,6.91C258.72,86,205.49,92,201.51,73.67Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M414.33,35.16V82H401.27V54l-9.59,18.59L382.09,54V82H369V35.16c18.83-3.73,18.2,7.52,22.65,15.17C398,30,405.25,35.86,414.33,35.16Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={'M425.9,35.16h39.64V47.29H440.25v5.76h16.48v11.1H440.25v5.76h25.29V82H425.9Z'}
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M520.2,35.16V82H507.15V54l-9.59,18.59L488,54.07V82H475V35.16c18.83-3.73,18.19,7.52,22.65,15.17C503.87,30,511.13,35.86,520.2,35.16Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M530.84,73.24C524.33,28.83,544.71,28.83,572,39.47,589.26,98.5,532.4,86.56,530.84,73.24ZM556,69c6.7-3.36,3.58-33.37-11.11-17.35C545.38,61.37,540.63,70.57,556,69Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path d={'M583.62,35.16H598V82H583.62Z'} transform={'translate(0 -4.47)'} />
    <path
      d={
        'M647.28,46.35,627.62,68.88h19.66V82H607.65c-4.9-10.89,14.94-27.33,19.66-33.72H607.65V35.16h39.63Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={'M657,35.16h39.6V47.29H671.31v5.76H687.8v11.1H671.31v5.76H696.6V82H657Z'}
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M578.18,16.31l5.44,12.59H598l4.92-12.58a.23.23,0,0,0-.14-.29.2.2,0,0,0-.2,0l-6.34,4.41a1,1,0,0,1-1.39-.25.92.92,0,0,1-.14-.28L591,8a.23.23,0,0,0-.29-.15.23.23,0,0,0-.15.15L587,20a1,1,0,0,1-1.24.67.83.83,0,0,1-.27-.12l-7-4.55a.23.23,0,0,0-.33.31Z'
      }
      fill={'url(#Безымянный_градиент_3)'}
      transform={'translate(0 -4.47)'}
    />
    <polygon
      fill={'url(#Безымянный_градиент_3-2)'}
      points={
        '159.87 10.3 152.8 12.87 150.23 19.94 147.66 12.87 140.59 10.3 147.66 7.73 150.23 0.66 152.8 7.73 159.87 10.3'
      }
    />
    <rect
      fill={'url(#Безымянный_градиент_10)'}
      height={'100.35'}
      rx={'11.49'}
      width={'80.74'}
      x={'266.13'}
      y={'7.85'}
    />
    <path
      d={
        'M338.77,115.4c-94.43-2.2-71.69,18.85-74.57-85.49.88-10.69-2.34-6.33,2.54-16.76C276.86,3.72,289,10.86,317,8.81c20.43.48,30.67-3.48,33.32,11.64C348.75,80.53,356.74,116.57,338.77,115.4Zm-63-99.58c-9.27-5.18-2.7,83.62-4.56,87.95-4.48,7.58,77.09,7.61,72.13,0-3.64-113.43,21.8-84-67.59-87.95Z'
      }
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M313.42,10.05,283.76,68.54a2.15,2.15,0,0,0,1.92,3.13H304l-5.22,43a.9.9,0,0,0,1.66.58l29.62-56a1.9,1.9,0,0,0-.77-2.57,1.81,1.81,0,0,0-.88-.23l-18.25-.23L315,10.57a.83.83,0,1,0-1.58-.52Z'
      }
      fill={'url(#Безымянный_градиент_25)'}
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M313.42,10.86,283.76,69.35a2.16,2.16,0,0,0,.93,2.9,2.28,2.28,0,0,0,1,.23H304l-5.22,43a.89.89,0,0,0,.79,1,.88.88,0,0,0,.87-.42l29.62-56a1.9,1.9,0,0,0-.77-2.57,1.92,1.92,0,0,0-.88-.23L310.17,57,315,11.38a.83.83,0,1,0-1.58-.52Z'
      }
      fill={'url(#Безымянный_градиент_11)'}
      transform={'translate(0 -4.47)'}
    />
    <path
      d={
        'M299.68,118.18a2.69,2.69,0,0,1-.4,0,3.39,3.39,0,0,1-3-3.78l4.88-40.2H285.67a4.76,4.76,0,0,1-2.12-.51,4.66,4.66,0,0,1-2-6.26L311.13,9a3.34,3.34,0,0,1,4.12-1.88,3.24,3.24,0,0,1,1.93,1.66,3.3,3.3,0,0,1,.29,2.2l-4.53,42.74,15.51.2a4.4,4.4,0,0,1,3.82,6.48l-29.69,56.13A3.41,3.41,0,0,1,299.68,118.18Zm4.33-49h2.82l-4.52,37.21,25.1-47.44-20-.25,4.17-39.46L286.24,69.17Zm-18,.5Zm-.32-.5Zm42.19-11.09h0Z'
      }
      fill={'url(#Безымянный_градиент_24)'}
      transform={'translate(0 -4.47)'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoizeLogoMinimalisticGolden)
const Memo = memo(ForwardRef)

export default Memo
