import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoLogoGolden = (props: SVGProps<SVGSVGElement>, ref: Ref<SVGSVGElement>) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    viewBox={'0 0 560.85 113.49'}
    xmlns={'http://www.w3.org/2000/svg'}
    {...props}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_3'}
        x1={'95.16'}
        x2={'114.44'}
        y1={'10.3'}
        y2={'10.3'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        id={'Безымянный_градиент_3-2'}
        x1={'88.52'}
        x2={'107.8'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'100.44'}
        y2={'100.44'}
      />
      <linearGradient
        id={'Безымянный_градиент_3-3'}
        x1={'400.16'}
        x2={'419.43'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'96.12'}
        y2={'96.12'}
      />
      <linearGradient
        gradientTransform={'translate(340.92 -238.35) rotate(90)'}
        id={'Безымянный_градиент_5'}
        x1={'255.3'}
        x2={'328.61'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'44.8'}
        y2={'44.8'}
      />
      <linearGradient
        gradientTransform={'translate(325.29 -223.74) rotate(90)'}
        id={'Безымянный_градиент_5-2'}
        x1={'237.88'}
        x2={'311.18'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'50.79'}
        y2={'50.79'}
      />
      <linearGradient
        gradientTransform={'translate(-3.18 2.86)'}
        id={'Безымянный_градиент_5-3'}
        x1={'220.17'}
        x2={'293.48'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'50.74'}
        y2={'50.74'}
      />
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.96, 203.84)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_25'}
        x1={'249.87'}
        x2={'255.66'}
        y1={'102.86'}
        y2={'70.2'}
      >
        <stop offset={'0'} stopColor={'#6a45ff'} />
        <stop offset={'0.28'} stopColor={'#7d40ff'} />
        <stop offset={'0.73'} stopColor={'#9839ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
      {/*!ЗАЛИВКА МОЛЛНИИ*/}
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.96, 203.84)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_4'}
        x1={'235.47'}
        x2={'260.04'}
        y1={'101.82'}
        y2={'79.54'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      {/*!КОНТУР МОЛНИИ*/}
      <linearGradient
        gradientTransform={'translate(-1.61 77.47) rotate(-15.3)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_24'}
        x1={'257.81'}
        x2={'247.22'}
        y1={'61.62'}
        y2={'26.47'}
      >
        <stop offset={'0'} stopColor={'#7200ff'} />
        <stop offset={'0.07'} stopColor={'#7605ff'} />
        <stop offset={'0.68'} stopColor={'#9628ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'matrix(1, 0, 0, -1, 5.43, -74.48)'}
        id={'Безымянный_градиент_5-4'}
        x1={'518.56'}
        x2={'545.69'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'-89.27'}
        y2={'-89.27'}
      />
    </defs>
    <title>cardMemoLogoGolden</title>
    <path
      d={
        'M1.65,70C-12.72,2.91,72.82,37.68,28.82,48.36c-18.84-19.56-17,36.34,0,12.33C73.42,74.46,3.11,90.77,1.65,70Z'
      }
    />
    <path
      d={
        'M77.8,71C59.42,67.5,61.9,82.61,46.56,78.79c19.24-81.59,37-46.86,47.5,0C87.33,78.44,77.65,81.75,77.8,71ZM74.65,59.46l-4.37-16-4.34,16Z'
      }
    />
    <path
      d={
        'M120,63.57h-6V78.79H99.66V31.91c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,82.49,124.92,70.7,120,63.57Zm-6-11.92c16.22,3.45,19.58-8.43,0-7Z'
      }
    />
    <path
      d={
        'M192.76,43.67c6,47-15.4,32.78-42.14,35.12V31.91C164.71,34.23,190.74,24.23,192.76,43.67Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21c16.28,3.61,13.39-5.73,13.76-17.38Z'
      }
    />
    <path
      d={
        'M399.92,31.39V78.23H386.86v-28l-9.59,18.59-9.59-18.59v28H354.59V31.39c18.83-3.73,18.2,7.52,22.65,15.17C383.59,26.23,390.84,32.09,399.92,31.39Z'
      }
    />
    <path d={'M411.49,31.39h39.64V43.52H425.84v5.76h16.48v11.1H425.84v5.76h25.29V78.23H411.49Z'} />
    <path
      d={
        'M505.79,31.39V78.23H492.74v-28l-9.59,18.59L473.59,50.3V78.23h-13V31.39c18.83-3.73,18.19,7.52,22.65,15.17C489.46,26.23,496.72,32.09,505.79,31.39Z'
      }
    />
    <path
      d={
        'M516.43,69.47c-6.51-44.41,13.87-44.41,41.16-33.77C574.85,94.73,518,82.79,516.43,69.47Zm25.16-4.24c6.7-3.36,3.58-33.37-11.11-17.35C531,57.6,526.22,66.8,541.59,65.23Z'
      }
    />
    <circle cx={'34.46'} cy={'98.97'} r={'6.52'} />
    <circle cx={'531.66'} cy={'98.97'} r={'6.52'} />
    <circle cx={'193.77'} cy={'97.07'} fill={'#4917aa'} r={'6.34'} />
    <circle cx={'342.99'} cy={'96.12'} fill={'#4917aa'} r={'6.34'} />
    <circle cx={'369'} cy={'12.82'} fill={'#4917aa'} r={'6.34'} />
    <circle cx={'480.42'} cy={'97.62'} r={'2.82'} />
    <circle cx={'203.4'} cy={'79.88'} r={'2.82'} />
    <circle cx={'319.83'} cy={'2.84'} r={'2.82'} />
    <circle cx={'258.71'} cy={'110.67'} fill={'#4917aa'} r={'2.82'} />
    <circle cx={'342.99'} cy={'74.24'} r={'2.82'} />
    <circle cx={'210.56'} cy={'9.85'} fill={'#4917aa'} r={'2.82'} />
    <circle cx={'171.88'} cy={'15.64'} r={'2.82'} />
    <circle cx={'486.14'} cy={'7.03'} fill={'#4917aa'} r={'2.82'} />
    <path
      d={
        'M104.8,10.3C77.45-1.92,49.72-4.47,20.44,9.23c8.2-1.47,15.58-4.08,22-3.57-11,7.23-12.59,9.19-16.08,14C49.29,1.32,72.78,2.42,104.8,10.3Z'
      }
    />
    <polygon
      fill={'url(#Безымянный_градиент_3)'}
      points={
        '114.44 10.3 107.37 12.87 104.8 19.94 102.22 12.87 95.16 10.3 102.22 7.73 104.8 0.66 107.37 7.73 114.44 10.3'
      }
    />
    <polygon
      fill={'url(#Безымянный_градиент_3-2)'}
      points={
        '107.8 100.44 100.73 103.02 98.16 110.08 95.59 103.02 88.52 100.44 95.59 97.87 98.16 90.81 100.73 97.87 107.8 100.44'
      }
    />
    <polygon
      fill={'url(#Безымянный_градиент_3-3)'}
      points={
        '419.43 96.12 412.37 98.7 409.79 105.76 407.22 98.7 400.15 96.12 407.22 93.55 409.79 86.49 412.37 93.55 419.43 96.12'
      }
    />
    <polygon
      fill={'#fff200'}
      points={
        '442.62 13.17 435.55 15.74 432.98 22.81 430.41 15.74 423.34 13.17 430.41 10.6 432.98 3.53 435.55 10.6 442.62 13.17'
      }
    />
    <rect
      fill={'url(#Безымянный_градиент_5)'}
      height={'73.3'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(177.27 330.07) rotate(-77)'}
      width={'91.11'}
      x={'250.57'}
      y={'16.95'}
    />
    <path
      d={
        'M313.79,106.36a12.84,12.84,0,0,1-2.87-.33l-51.09-11.8a12.65,12.65,0,0,1-9.47-15.15l15.81-68.44a12.63,12.63,0,0,1,15.15-9.46L332.41,13a12.66,12.66,0,0,1,9.47,15.15L326.07,96.57a12.63,12.63,0,0,1-12.28,9.79ZM278.47,5.25a8.25,8.25,0,0,0-8,6.38l-15.8,68.44A8.25,8.25,0,0,0,260.82,90l51.09,11.8a8.24,8.24,0,0,0,9.88-6.17l15.8-68.45a8.24,8.24,0,0,0-6.17-9.87L280.33,5.46A8.42,8.42,0,0,0,278.47,5.25Z'
      }
    />
    <rect
      fill={'url(#Безымянный_градиент_5-2)'}
      height={'73.3'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(222.87 325.14) rotate(-89.83)'}
      width={'91.11'}
      x={'228.95'}
      y={'14.14'}
    />
    <path
      d={
        'M300.61,98.63h0l-52.44-.16a12.65,12.65,0,0,1-12.6-12.67l.22-70.24A12.63,12.63,0,0,1,248.43,3l52.44.16a12.65,12.65,0,0,1,12.59,12.67L313.25,86A12.66,12.66,0,0,1,300.61,98.63ZM248.39,7.36a8.25,8.25,0,0,0-8.23,8.21l-.22,70.24a8.25,8.25,0,0,0,8.21,8.26l52.44.16h0A8.25,8.25,0,0,0,308.85,86l.21-70.24a8.25,8.25,0,0,0-8.21-8.26l-52.44-.16Z'
      }
    />
    <rect
      fill={'url(#Безымянный_градиент_5-3)'}
      height={'91.11'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(-4.97 71.7) rotate(-15.93)'}
      width={'73.3'}
      x={'217'}
      y={'8.05'}
    />
    <path
      d={
        'M238.08,107.21A12.67,12.67,0,0,1,225.93,98L206.65,30.5a12.66,12.66,0,0,1,8.68-15.62h0L265.75.49a12.66,12.66,0,0,1,15.62,8.67l19.28,67.55A12.64,12.64,0,0,1,292,92.32l-50.42,14.4A12.64,12.64,0,0,1,238.08,107.21ZM269.22,4.4a8,8,0,0,0-2.26.32L216.53,19.11a8.24,8.24,0,0,0-5.65,10.18l19.28,67.54a8.25,8.25,0,0,0,10.18,5.66l50.43-14.4a8.23,8.23,0,0,0,5.65-10.17L277.14,10.37A8.26,8.26,0,0,0,269.22,4.4Z'
      }
    />
    <path
      d={
        'M248.71,16.47,239.37,62a1.51,1.51,0,0,0,1.18,1.8,1.42,1.42,0,0,0,.71,0l12.54-3.43,4.48,30.39a.63.63,0,0,0,.72.53.62.62,0,0,0,.52-.45L269.3,47a1.34,1.34,0,0,0-1-1.61,1.38,1.38,0,0,0-.64,0l-12.53,3.26-5.24-32.12a.59.59,0,1,0-1.17-.06Z'
      }
      fill={'url(#Безымянный_градиент_25)'}
    />
    <path
      d={
        'M248.86,17l-9.34,45.55a1.52,1.52,0,0,0,1.18,1.81,1.59,1.59,0,0,0,.72,0L254,60.93l4.48,30.38a.64.64,0,0,0,1.24.09l9.78-43.84a1.34,1.34,0,0,0-1-1.62,1.38,1.38,0,0,0-.64,0l-12.52,3.26L250,17.08a.59.59,0,0,0-1.18-.06Z'
      }
      fill={'url(#Безымянный_градиент_4)'}
    />
    <path
      d={
        'M259.54,93l-.28.06a2.41,2.41,0,0,1-2.74-2l-4.18-28.4-10.61,2.9h0a3.34,3.34,0,0,1-1.54,0,3.3,3.3,0,0,1-2.55-3.9L247,16.2a2.37,2.37,0,0,1,2.47-2.06,2.38,2.38,0,0,1,2.24,2.23l4.9,30.08,10.64-2.77A3.12,3.12,0,0,1,271,47.4l-9.81,43.94A2.41,2.41,0,0,1,259.54,93Zm-6.21-34.33,1.93-.53,3.88,26.29,8.28-37.13-13.73,3.57-4.53-27.77-8,38.9ZM241.1,62.37h0Zm-.31-.28Zm26.78-15.48h0Z'
      }
      fill={'url(#Безымянный_градиент_24)'}
    />
    <path
      d={
        'M524.05,12.1l6,13.77a35.62,35.62,0,0,0,15.73,0l5.38-13.75a.26.26,0,0,0-.16-.32.22.22,0,0,0-.22,0l-6.93,4.82a1.1,1.1,0,0,1-1.52-.27,1,1,0,0,1-.15-.31L538.07,3a.25.25,0,0,0-.32-.17h0a.25.25,0,0,0-.16.17L533.7,16.14a1.1,1.1,0,0,1-1.36.73.81.81,0,0,1-.3-.13l-7.65-5a.24.24,0,0,0-.35.05.24.24,0,0,0,0,.28Z'
      }
      fill={'url(#Безымянный_градиент_5-4)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoLogoGolden)
const Memo = memo(ForwardRef)

export default Memo
