import type { SVGProps } from 'react'
import { Ref, forwardRef, memo } from 'react'

const SvgCardMemoLogoMinimalisticGolden = (
  props: SVGProps<SVGSVGElement>,
  ref: Ref<SVGSVGElement>
) => (
  <svg
    data-name={'Слой 5'}
    id={'Слой_5'}
    ref={ref}
    viewBox={'0 0 560.85 107.86'}
    xmlns={'http://www.w3.org/2000/svg'}
    {...props}
    // xmlns:xlink={'http://www.w3.org/1999/xlink'}
  >
    <defs>
      <linearGradient
        gradientTransform={'translate(340.9 -238.5) rotate(90)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_3'}
        x1={'255.45'}
        x2={'328.75'}
        y1={'44.78'}
        y2={'44.78'}
      >
        <stop offset={'0'} stopColor={'#ffd22e'} />
        <stop offset={'1'} stopColor={'#ffa617'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'translate(325.29 -223.74) rotate(90)'}
        id={'Безымянный_градиент_3-2'}
        x1={'237.88'}
        x2={'311.19'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'50.79'}
        y2={'50.79'}
      />
      <linearGradient
        gradientTransform={'translate(-3 2.88)'}
        id={'Безымянный_градиент_3-3'}
        x1={'220'}
        x2={'293.3'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'50.72'}
        y2={'50.72'}
      />
      <linearGradient
        gradientTransform={'matrix(0.73, -0.68, -0.68, -0.73, 92.34, 297.86)'}
        id={'Безымянный_градиент_3-4'}
        x1={'263.36'}
        x2={'290.49'}
        xlinkHref={'#Безымянный_градиент_3'}
        y1={'133.09'}
        y2={'133.09'}
      />
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.79, 202.58)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_25'}
        x1={'249.7'}
        x2={'255.49'}
        y1={'101.59'}
        y2={'68.94'}
      >
        <stop offset={'0'} stopColor={'#6a45ff'} />
        <stop offset={'0.28'} stopColor={'#7d40ff'} />
        <stop offset={'0.73'} stopColor={'#9839ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'matrix(0.96, -0.26, -0.26, -0.96, 32.79, 202.58)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_2'}
        x1={'235.3'}
        x2={'259.87'}
        y1={'100.55'}
        y2={'78.28'}
      >
        <stop offset={'0'} stopColor={'#3a00e7'} />
        <stop offset={'1'} stopColor={'#8d00b9'} />
      </linearGradient>
      <linearGradient
        gradientTransform={'translate(-1.44 77.45) rotate(-15.3)'}
        gradientUnits={'userSpaceOnUse'}
        id={'Безымянный_градиент_24'}
        x1={'257.64'}
        x2={'247.05'}
        y1={'61.59'}
        y2={'26.44'}
      >
        <stop offset={'0'} stopColor={'#7200ff'} />
        <stop offset={'0.07'} stopColor={'#7605ff'} />
        <stop offset={'0.68'} stopColor={'#9628ff'} />
        <stop offset={'1'} stopColor={'#a236ff'} />
      </linearGradient>
    </defs>
    <title>cardMemoLogoMinimalisticGolden</title>
    <path
      d={
        'M1.65,69.35C-12.72,2.27,72.82,37,28.82,47.72c-18.84-19.56-17,36.34,0,12.33C73.42,73.82,3.11,90.13,1.65,69.35Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M77.8,70.33C59.42,66.86,61.9,82,46.56,78.15c19.24-81.59,37-46.86,47.5,0C87.33,77.8,77.65,81.11,77.8,70.33ZM74.65,58.82l-4.37-16-4.34,16Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M120,62.93h-6V78.15H99.66V31.27c28.08-2.44,58.12-.18,34.85,31.33l8.93,15.55C122.83,81.85,124.92,70.06,120,62.93ZM114,51c16.22,3.45,19.58-8.43,0-7Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M192.76,43c6,47-15.4,32.78-42.14,35.12V31.27C164.71,33.59,190.74,23.59,192.76,43Zm-14,4.81c.61-3.64-8.4-4-13.78-3.62v21c16.28,3.61,13.39-5.73,13.76-17.38Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M399.92,30.75V77.59H386.86v-28l-9.59,18.59-9.59-18.59v28H354.59V30.75c18.83-3.73,18.2,7.52,22.65,15.17C383.59,25.59,390.84,31.45,399.92,30.75Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={'M411.49,30.75h39.64V42.88H425.84v5.76h16.48v11.1H425.84V65.5h25.29V77.59H411.49Z'}
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M505.79,30.75V77.59H492.74v-28l-9.59,18.59-9.56-18.52V77.59h-13V30.75c18.83-3.73,18.19,7.52,22.65,15.17C489.46,25.59,496.72,31.45,505.79,30.75Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M516.43,68.83c-6.51-44.41,13.87-44.41,41.16-33.77C574.85,94.09,518,82.15,516.43,68.83Zm25.16-4.24c6.7-3.36,3.58-33.37-11.11-17.35C531,57,526.22,66.16,541.59,64.59Z'
      }
      transform={'translate(0 0.65)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_3)'}
      height={'73.3'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(177.27 330.72) rotate(-77)'}
      width={'91.11'}
      x={'250.57'}
      y={'16.95'}
    />
    <path
      d={
        'M313.79,106.36a12.84,12.84,0,0,1-2.87-.33l-51.09-11.8a12.65,12.65,0,0,1-9.47-15.15l15.81-68.44a12.63,12.63,0,0,1,15.15-9.46L332.41,13a12.66,12.66,0,0,1,9.47,15.15L326.07,96.57a12.63,12.63,0,0,1-12.28,9.79ZM278.47,5.25a8.25,8.25,0,0,0-8,6.38l-15.8,68.44A8.25,8.25,0,0,0,260.82,90l51.09,11.8a8.24,8.24,0,0,0,9.88-6.17l15.8-68.45a8.24,8.24,0,0,0-6.17-9.87L280.33,5.46A8.42,8.42,0,0,0,278.47,5.25Z'
      }
      transform={'translate(0 0.65)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_3-2)'}
      height={'73.3'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(222.87 325.79) rotate(-89.83)'}
      width={'91.11'}
      x={'228.95'}
      y={'14.14'}
    />
    <path
      d={
        'M300.61,98.63h0l-52.44-.16a12.65,12.65,0,0,1-12.6-12.67l.22-70.24A12.63,12.63,0,0,1,248.43,3l52.44.16a12.65,12.65,0,0,1,12.59,12.67L313.25,86A12.66,12.66,0,0,1,300.61,98.63ZM248.39,7.36a8.25,8.25,0,0,0-8.23,8.21l-.22,70.24a8.25,8.25,0,0,0,8.21,8.26l52.44.16h0A8.25,8.25,0,0,0,308.85,86l.21-70.24a8.25,8.25,0,0,0-8.21-8.26l-52.44-.16Z'
      }
      transform={'translate(0 0.65)'}
    />
    <rect
      fill={'url(#Безымянный_градиент_3-3)'}
      height={'91.11'}
      rx={'10.43'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(-4.97 72.35) rotate(-15.93)'}
      width={'73.3'}
      x={'217'}
      y={'8.05'}
    />
    <path
      d={
        'M238.08,107.21A12.67,12.67,0,0,1,225.93,98L206.65,30.5a12.66,12.66,0,0,1,8.68-15.62h0L265.75.49a12.66,12.66,0,0,1,15.62,8.67l19.28,67.55A12.64,12.64,0,0,1,292,92.32l-50.42,14.4A12.64,12.64,0,0,1,238.08,107.21ZM269.22,4.4a8,8,0,0,0-2.26.32L216.53,19.11a8.24,8.24,0,0,0-5.65,10.18l19.28,67.54a8.25,8.25,0,0,0,10.18,5.66l50.43-14.4a8.23,8.23,0,0,0,5.65-10.17L277.14,10.37A8.26,8.26,0,0,0,269.22,4.4Z'
      }
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M193.63,19.35l13.72,6.08A35.7,35.7,0,0,0,218.9,14.75L213.51,1a.25.25,0,0,0-.33-.13A.22.22,0,0,0,213,1L211.2,9.26a1.1,1.1,0,0,1-1.3.84,1.27,1.27,0,0,1-.32-.13L197.76,3.16a.25.25,0,0,0-.34.1h0a.24.24,0,0,0,0,.23l6.05,12.28a1.1,1.1,0,0,1-.5,1.46.87.87,0,0,1-.31.1l-9,1.54a.26.26,0,0,0-.22.28.26.26,0,0,0,.19.22Z'
      }
      fill={'url(#Безымянный_градиент_3-4)'}
      stroke={'#ffa300'}
      strokeMiterlimit={'10'}
      strokeWidth={'3'}
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M248.71,16.47,239.37,62a1.51,1.51,0,0,0,1.18,1.8,1.42,1.42,0,0,0,.71,0l12.54-3.43,4.48,30.39a.63.63,0,0,0,.72.53.62.62,0,0,0,.52-.45L269.3,47a1.34,1.34,0,0,0-1-1.61,1.38,1.38,0,0,0-.64,0l-12.53,3.26-5.24-32.12a.59.59,0,1,0-1.17-.06Z'
      }
      fill={'url(#Безымянный_градиент_25)'}
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M248.86,17l-9.34,45.55a1.52,1.52,0,0,0,1.18,1.81,1.59,1.59,0,0,0,.72,0L254,60.93l4.48,30.38a.64.64,0,0,0,1.24.09l9.78-43.84a1.34,1.34,0,0,0-1-1.62,1.38,1.38,0,0,0-.64,0l-12.52,3.26L250,17.08a.59.59,0,0,0-1.18-.06Z'
      }
      fill={'url(#Безымянный_градиент_2)'}
      transform={'translate(0 0.65)'}
    />
    <path
      d={
        'M259.54,93l-.28.06a2.41,2.41,0,0,1-2.74-2l-4.18-28.4-10.61,2.9h0a3.34,3.34,0,0,1-1.54,0,3.3,3.3,0,0,1-2.55-3.9L247,16.2a2.37,2.37,0,0,1,2.47-2.06,2.38,2.38,0,0,1,2.24,2.23l4.9,30.08,10.64-2.77A3.12,3.12,0,0,1,271,47.4l-9.81,43.94A2.41,2.41,0,0,1,259.54,93Zm-6.21-34.33,1.93-.53,3.88,26.29,8.28-37.13-13.73,3.57-4.53-27.77-8,38.9ZM241.1,62.37h0Zm-.31-.28Zm26.78-15.48h0Z'
      }
      fill={'url(#Безымянный_градиент_24)'}
      transform={'translate(0 0.65)'}
    />
  </svg>
)
const ForwardRef = forwardRef(SvgCardMemoLogoMinimalisticGolden)
const Memo = memo(ForwardRef)

export default Memo
